app/Controllers/AuthController.php

    public function store()
    {
        $model = new UserModel();
        $token = bin2hex(random_bytes(16)); // unique token
        $data = [
            'email'    => $this->request->getPost('email'),
            'password'      => $this->request->getPost('password'),
            'active_status' => 'no',
            'token'         => $token
        ];
        $model->insert($data);
---
INSERT INTO `users` (`email`, `password`, `active_status`, `token`) VALUES ('javithhanif732@gmail.com', 'njjss', 'no', '8b334375940f7bdc7225055e5dbc2902')

    public function verify($token)
    {
        $model = new UserModel();
        $user  = $model->where('token', $token)->first();
        if ($user){
            $model->update($user['id'], ['active_status' => 'yes']);
---
SELECT *
FROM `users`
WHERE `token` = '8b334375940f7bdc7225055e5dbc2902'
 LIMIT 1
UPDATE `users` SET `active_status` = 'yes'
WHERE `users`.`id` IN ('7')

    public function authenticate()
    {
        $session = session();
        $model   = new UserModel();
        //$users=$model->findAll();
        $email    = $this->request->getPost('from_email');
        $password = $this->request->getPost('password');
        $user = $model->where('email', $email)->first();
        $pass = $model->where('password', $password)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'javith0617@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `password` = 'njjss'
 LIMIT 1

    public function edit()
    {
        $id = session()->get('user_id');
        $model = new UserModel();
        $data['user'] = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'

     public function detailedit()
    {
        $id = session()->get('user_id');
        $model = new UserModel();
        $data['detail'] = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '20'

     public function skilledit()
    {
        $id = session()->get('user_id');
        $model = new UserModel();
        $data['skill'] = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '20'

    public function ad(){
        $model=new AdLogModel();
        $username=$this->request->getPost('username');
        $password=$this->request->getPost('password');
        $user = $model->where('username', $username)->first();
        $pass = $model->where('password', $password)->first();
        if($user && $pass){
             if($pass['active_status'] === 'ad')
            {
                /*
                $session->set([
                    'user_id'   => $user['id'],
                    //'from_email'=> $user['from_email'],
                    'logged_in' => true,
                ]);
                */
                $mode=new UserModel();
                $data['rice']=$mode->findAll();
---
SELECT *
FROM `users`

public function view($id = null)
{
    $userModel = new UserModel();
    $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'

public function delete($id)
{
    $userModel = new UserModel();

    if ($userModel->delete($id)) {
---
DELETE FROM `users`
WHERE `id` IN ('6')